CREATE TABLE по_номеру (
    Подкатегория TEXT,
    Источник TEXT,
    Ссылка TEXT,
    Название TEXT,
    Описание TEXT,
    Теги TEXT,
    RU TEXT,
    BL TEXT,
    UA TEXT,
    KZ TEXT,
    ARM TEXT,
    USA TEXT,
    EU TEXT
);

INSERT INTO
    по_номеру (
        Подкатегория,
        Источник,
        Ссылка,
        Название,
        Описание,
        Теги,
        RU,
        BL,
        UA,
        KZ,
        ARM,
        USA,
        EU
    )
VALUES
    (
        'по номеру телефона',
        'S',
        'https://smsc.ru',
        'SMSCenter',
        'статус активности номера телефона',
        'Twitter',
        '0',
        '0',
        '0',
        '0',
        '1',
        '1',
        '0'
    );

INSERT INTO
    по_номеру (
        Подкатегория,
        Источник,
        Ссылка,
        Название,
        Описание,
        Теги,
        RU,
        BL,
        UA,
        KZ,
        ARM,
        USA,
        EU
    )
VALUES
    (
        'по номеру телефона',
        'G',
        'https://github.com/megadose/ignorant/',
        'Ingorant',
        'находит к какому сайту привязан номер телефона',
        'Бесплатно',
        '0',
        '1',
        '0',
        '1',
        '0',
        '0',
        '0'
    );

INSERT INTO
    по_номеру (
        Подкатегория,
        Источник,
        Ссылка,
        Название,
        Описание,
        Теги,
        RU,
        BL,
        UA,
        KZ,
        ARM,
        USA,
        EU
    )
VALUES
    (
        'по номеру телефона',
        'T',
        'https://t.me/clerkinfobot',
        'Clerkinfobot',
        'находит объявления и как записан номер телефона в контактах, берет данные из приложения getcontact',
        'Бесплатно,facebook',
        '1',
        '0',
        '1',
        '1',
        '1',
        '1',
        '1'
    );

INSERT INTO
    по_номеру (
        Подкатегория,
        Источник,
        Ссылка,
        Название,
        Описание,
        Теги,
        RU,
        BL,
        UA,
        KZ,
        ARM,
        USA,
        EU
    )
VALUES
    (
        'по номеру телефона',
        'S',
        'https://tools.whoisxmlapi.com',
        'WhisX',
        'выявляет домены веб-сайтов зарегистрированные на номер телефона',
        'Бесплатно,github',
        '1',
        '1',
        '1',
        '1',
        '1',
        '1',
        '1'
    );

INSERT INTO
    по_номеру (
        Подкатегория,
        Источник,
        Ссылка,
        Название,
        Описание,
        Теги,
        RU,
        BL,
        UA,
        KZ,
        ARM,
        USA,
        EU
    )
VALUES
    (
        'по номеру автомобиля',
        'S',
        'https://vin01.ru',
        'VIN01',
        'найдет VIN и по нему покажет историю регистраций, историю ДТП, пробег, ОСАГО и многое другое',
        'Бесплатно,github',
        '1',
        '1',
        '1',
        '1',
        '1',
        '0',
        '1'
    );

INSERT INTO
    по_номеру (
        Подкатегория,
        Источник,
        Ссылка,
        Название,
        Описание,
        Теги,
        RU,
        BL,
        UA,
        KZ,
        ARM,
        USA,
        EU
    )
VALUES
    (
        'по номеру автомобиля',
        'S',
        'https://vinformer.su',
        'VIN former',
        'проверка ПТС, поиск по VIN',
        'Twitter',
        '1',
        '1',
        '1',
        '1',
        '1',
        '0',
        '1'
    );

INSERT INTO
    по_номеру (
        Подкатегория,
        Источник,
        Ссылка,
        Название,
        Описание,
        Теги,
        RU,
        BL,
        UA,
        KZ,
        ARM,
        USA,
        EU
    )
VALUES
    (
        'по номеру автомобиля',
        'T',
        'https://t.me/Antiparkonewbot',
        'Anti',
        'найдет номер телефона владельца, маловероятно что результат будет',
        'Twitter',
        '1',
        '1',
        '1',
        '1',
        '1',
        '1',
        '1'
    );

INSERT INTO
    по_номеру (
        Подкатегория,
        Источник,
        Ссылка,
        Название,
        Описание,
        Теги,
        RU,
        BL,
        UA,
        KZ,
        ARM,
        USA,
        EU
    )
VALUES
    (
        'по номеру автомобиля',
        'S',
        'https://nomerogram.ru',
        'Monerogram',
        'найдет фото автомобиля, поиск по гос. номеру',
        'VKontakte',
        '1',
        '1',
        '0',
        '0',
        '1',
        '1',
        '0'
    );

INSERT INTO
    по_номеру (
        Подкатегория,
        Источник,
        Ссылка,
        Название,
        Описание,
        Теги,
        RU,
        BL,
        UA,
        KZ,
        ARM,
        USA,
        EU
    )
VALUES
    (
        'по номеру документа',
        'S',
        'https://ib.open.ru',
        'Open',
        'покажет часть номера телефона владельца карты, отправляет уведомление на телефон владельца карты',
        'Бесплатно,github',
        '0',
        '0',
        '0',
        '0',
        '0',
        '1',
        '0'
    );

INSERT INTO
    по_номеру (
        Подкатегория,
        Источник,
        Ссылка,
        Название,
        Описание,
        Теги,
        RU,
        BL,
        UA,
        KZ,
        ARM,
        USA,
        EU
    )
VALUES
    (
        'по номеру документа',
        'S',
        'https://vinformer.su',
        'VINOK',
        'даёт интересы аккаунта, а платно выдаст историю изменения имени, номер телефона, группы и ссылки которые публиковал пользователь',
        'Twitter',
        '0',
        '0',
        '0',
        '1',
        '0',
        '1',
        '1'
    );

INSERT INTO
    по_номеру (
        Подкатегория,
        Источник,
        Ссылка,
        Название,
        Описание,
        Теги,
        RU,
        BL,
        UA,
        KZ,
        ARM,
        USA,
        EU
    )
VALUES
    (
        'по номеру документа',
        'T',
        'https://t.me/Antiparkonewbot',
        'Anti',
        'выдаст примерную дату регистрации аккаунта, отправьте боту числовой ID аккаунта или перешлите сообщение',
        'Twitter',
        '1',
        '1',
        '0',
        '1',
        '0',
        '1',
        '1'
    );

INSERT INTO
    по_номеру (
        Подкатегория,
        Источник,
        Ссылка,
        Название,
        Описание,
        Теги,
        RU,
        BL,
        UA,
        KZ,
        ARM,
        USA,
        EU
    )
VALUES
    (
        'по номеру банк.карт/счета',
        'S',
        'https://vinformer.su',
        'SMSCenter',
        'выдает по ID имя пользователя аккаунта Telegram, отправь боту команду /resolve + ID',
        'Бесплатно,github',
        '1',
        '1',
        '1',
        '1',
        '1',
        '0',
        '1'
    );

INSERT INTO
    по_номеру (
        Подкатегория,
        Источник,
        Ссылка,
        Название,
        Описание,
        Теги,
        RU,
        BL,
        UA,
        KZ,
        ARM,
        USA,
        EU
    )
VALUES
    (
        'по номеру банк.карт/счета',
        'S',
        'https://vinformer.su',
        'Ingorant',
        'даёт интересы аккаунта, а платно выдаст историю изменения имени, номер телефона, группы и ссылки которые публиковал пользователь',
        'Twitter',
        '1',
        '1',
        '1',
        '1',
        '1',
        '0',
        '1'
    );

INSERT INTO
    по_номеру (
        Подкатегория,
        Источник,
        Ссылка,
        Название,
        Описание,
        Теги,
        RU,
        BL,
        UA,
        KZ,
        ARM,
        USA,
        EU
    )
VALUES
    (
        'по номеру банк.карт/счета',
        'T',
        'https://t.me/Antiparkonewbot',
        'Clerkinfobot',
        'выдаст примерную дату регистрации аккаунта, отправьте боту числовой ID аккаунта или перешлите сообщение',
        'Twitter',
        '1',
        '1',
        '1',
        '1',
        '1',
        '1',
        '1'
    );

INSERT INTO
    по_номеру (
        Подкатегория,
        Источник,
        Ссылка,
        Название,
        Описание,
        Теги,
        RU,
        BL,
        UA,
        KZ,
        ARM,
        USA,
        EU
    )
VALUES
    (
        'по дате рождения',
        'S',
        'https://vinformer.su',
        'SMSCenter',
        'найдет сохранённую копию аккаунта по ID, это аватарка  и имя, после регистрации, нажми на +, и выбери "начать новый чат", введи id в поиск',
        'Бесплатно,github',
        '1',
        '1',
        '1',
        '1',
        '1',
        '0',
        '1'
    );

INSERT INTO
    по_номеру (
        Подкатегория,
        Источник,
        Ссылка,
        Название,
        Описание,
        Теги,
        RU,
        BL,
        UA,
        KZ,
        ARM,
        USA,
        EU
    )
VALUES
    (
        'по дате рождения',
        'T',
        'https://t.me/Antiparkonewbot',
        'Ingorant',
        'найдет номер телефона, почту, имя, для поиска создай и подключи свой тг-бот',
        'Twitter',
        '1',
        '1',
        '1',
        '1',
        '1',
        '1',
        '1'
    );

CREATE TABLE по_тексту (
    Подкатегория TEXT,
    Источник TEXT,
    Ссылка TEXT,
    Название TEXT,
    Описание TEXT,
    Теги TEXT,
    RU TEXT,
    BL TEXT,
    UA TEXT,
    KZ TEXT,
    ARM TEXT,
    USA TEXT,
    EU TEXT
);

INSERT INTO
    по_тексту (
        Подкатегория,
        Источник,
        Ссылка,
        Название,
        Описание,
        Теги,
        RU,
        BL,
        UA,
        KZ,
        ARM,
        USA,
        EU
    )
VALUES
    (
        'по ФИО',
        'S',
        'https://smsc.ru',
        'SMSCenter',
        'статус активности номера телефона',
        'Twitter',
        '0',
        '0',
        '0',
        '0',
        '1',
        '1',
        '0'
    );

INSERT INTO
    по_тексту (
        Подкатегория,
        Источник,
        Ссылка,
        Название,
        Описание,
        Теги,
        RU,
        BL,
        UA,
        KZ,
        ARM,
        USA,
        EU
    )
VALUES
    (
        'по ФИО',
        'G',
        'https://github.com/megadose/ignorant/',
        'Ingorant',
        'находит к какому сайту привязан номер телефона',
        'Бесплатно',
        '0',
        '1',
        '0',
        '1',
        '0',
        '0',
        '0'
    );

INSERT INTO
    по_тексту (
        Подкатегория,
        Источник,
        Ссылка,
        Название,
        Описание,
        Теги,
        RU,
        BL,
        UA,
        KZ,
        ARM,
        USA,
        EU
    )
VALUES
    (
        'по ФИО',
        'T',
        'https://t.me/clerkinfobot',
        'Clerkinfobot',
        'находит объявления и как записан номер телефона в контактах, берет данные из приложения getcontact',
        'Бесплатно,facebook',
        '1',
        '0',
        '1',
        '1',
        '1',
        '1',
        '1'
    );

INSERT INTO
    по_тексту (
        Подкатегория,
        Источник,
        Ссылка,
        Название,
        Описание,
        Теги,
        RU,
        BL,
        UA,
        KZ,
        ARM,
        USA,
        EU
    )
VALUES
    (
        'по ФИО',
        'S',
        'https://tools.whoisxmlapi.com',
        'WhisX',
        'выявляет домены веб-сайтов зарегистрированные на номер телефона',
        'Бесплатно,github',
        '1',
        '1',
        '1',
        '1',
        '1',
        '1',
        '1'
    );

INSERT INTO
    по_тексту (
        Подкатегория,
        Источник,
        Ссылка,
        Название,
        Описание,
        Теги,
        RU,
        BL,
        UA,
        KZ,
        ARM,
        USA,
        EU
    )
VALUES
    (
        'по паролю',
        'S',
        'https://vin01.ru',
        'VIN01',
        'найдет VIN и по нему покажет историю регистраций, историю ДТП, пробег, ОСАГО и многое другое',
        'Бесплатно,github',
        '1',
        '1',
        '1',
        '1',
        '1',
        '0',
        '1'
    );

INSERT INTO
    по_тексту (
        Подкатегория,
        Источник,
        Ссылка,
        Название,
        Описание,
        Теги,
        RU,
        BL,
        UA,
        KZ,
        ARM,
        USA,
        EU
    )
VALUES
    (
        'по паролю',
        'S',
        'https://vinformer.su',
        'VIN former',
        'проверка ПТС, поиск по VIN',
        'Twitter',
        '1',
        '1',
        '1',
        '1',
        '1',
        '0',
        '1'
    );

INSERT INTO
    по_тексту (
        Подкатегория,
        Источник,
        Ссылка,
        Название,
        Описание,
        Теги,
        RU,
        BL,
        UA,
        KZ,
        ARM,
        USA,
        EU
    )
VALUES
    (
        'по паролю',
        'T',
        'https://t.me/Antiparkonewbot',
        'Anti',
        'найдет номер телефона владельца, маловероятно что результат будет',
        'Twitter',
        '1',
        '1',
        '1',
        '1',
        '1',
        '1',
        '1'
    );

INSERT INTO
    по_тексту (
        Подкатегория,
        Источник,
        Ссылка,
        Название,
        Описание,
        Теги,
        RU,
        BL,
        UA,
        KZ,
        ARM,
        USA,
        EU
    )
VALUES
    (
        'по паролю',
        'S',
        'https://nomerogram.ru',
        'Monerogram',
        'найдет фото автомобиля, поиск по гос. номеру',
        'VKontakte',
        '1',
        '1',
        '0',
        '0',
        '1',
        '1',
        '0'
    );

INSERT INTO
    по_тексту (
        Подкатегория,
        Источник,
        Ссылка,
        Название,
        Описание,
        Теги,
        RU,
        BL,
        UA,
        KZ,
        ARM,
        USA,
        EU
    )
VALUES
    (
        'по e-mail',
        'S',
        'https://ib.open.ru',
        'Open',
        'покажет часть номера телефона владельца карты, отправляет уведомление на телефон владельца карты',
        'Бесплатно,github',
        '0',
        '0',
        '0',
        '0',
        '0',
        '1',
        '0'
    );

INSERT INTO
    по_тексту (
        Подкатегория,
        Источник,
        Ссылка,
        Название,
        Описание,
        Теги,
        RU,
        BL,
        UA,
        KZ,
        ARM,
        USA,
        EU
    )
VALUES
    (
        'по e-mail',
        'S',
        'https://vinformer.su',
        'VINOK',
        'даёт интересы аккаунта, а платно выдаст историю изменения имени, номер телефона, группы и ссылки которые публиковал пользователь',
        'Twitter',
        '0',
        '0',
        '0',
        '1',
        '0',
        '1',
        '1'
    );

INSERT INTO
    по_тексту (
        Подкатегория,
        Источник,
        Ссылка,
        Название,
        Описание,
        Теги,
        RU,
        BL,
        UA,
        KZ,
        ARM,
        USA,
        EU
    )
VALUES
    (
        'по e-mail',
        'T',
        'https://t.me/Antiparkonewbot',
        'Anti',
        'выдаст примерную дату регистрации аккаунта, отправьте боту числовой ID аккаунта или перешлите сообщение',
        'Twitter',
        '1',
        '1',
        '0',
        '1',
        '0',
        '1',
        '1'
    );